Repository: n2duc/react_vite-lingui_i18n
Catalog: src/locales/*.po
Languages: fr, ja, ko, ru, vi

source: {count, plural, one {# month} other {# months}}
fr: {count, plural, many {# de mois} other {# mois}}
ja: {count, plural, other {#ヶ月}}
ko: {count, plural, other {#개월}}
ru: {count, plural, one {# месяц} few {# месяца} many {# месяцев} other {# месяцев}}
vi: {count, plural, other {# tháng}}

source: {messagesCount, plural, one {There's # message in your inbox} other {There are # messages in your inbox}}
fr: {messagesCount, plural, other {Il y a # message dans votre boîte de réception}}
ja: {messagesCount, plural, other {受信箱に#件のメッセージがあります}}
ko: {messagesCount, plural, other {받은편지함에 #개의 메시지가 있습니다}}
ru: {messagesCount, plural, one {В вашем ящике # сообщение} few {В вашем ящике # сообщения} many {В вашем ящике # сообщений} other {В вашем ящике # сообщений}}
vi: {messagesCount, plural, other {Có # tin nhắn trong hộp thư của bạn}}

source: All orders are carefully packaged and fully insured. Track your shipment in real-time through our dedicated tracking portal.
fr: Toutes les commandes sont soigneusement emballées et assurées. Suivez votre envoi en temps réel via notre portail de suivi dédié.
ja: すべての注文は慎重に梱包され、完全に保険されています。専用のトラッキングポータルを通じて、実時間でお客様の発送を追跡できます。
ko: 모든 주문은 신중하게 포장되고 완전히 보험됩니다. 전용 추적 포탈을 통해 실시간으로 발송을 추적할 수 있습니다.
ru: Все заказы тщательно упакованы и полностью застрахованы. Отслеживайте свою доставку в режиме реального времени через наш специальный портал отслеживания.
vi: Tất cả các đơn hàng được đóng gói cẩn thận và được bảo hiểm đầy đủ. Theo dõi đơn hàng của bạn trực tiếp thông qua cổng theo dõi đặc biệt của chúng tôi.

source: Edit <0>src/App.tsx</0> and save to test HMR
fr: Modifier <0>src/App.tsx</0> et enregistrer pour tester HMR
ja: <0>src/App.tsx</0>を編集して保存し、HMRをテストしてください
ko: <0>src/App.tsx</0>를 수정하고 저장하여 HMR을 테스트하세요
ru: Редактируйте <0>src/App.tsx</0> и сохраните для тестирования HMR
vi: Chỉnh sửa file <0>src/App.tsx</0> và lưu để kiểm tra HMR

source: Key features include advanced processing capabilities, and an intuitive user interface designed for both beginners and experts.
fr: Les fonctionnalités clés comprennent des capacités de traitement avancées et une interface utilisateur intuitive conçue pour les débutants et les experts.
ja: 主要機能には、高度な処理能力と、初心者と上級者の両方に適した直感的なユーザーインターフェースが含まれています。
ko: 주요 기능에는 고급 처리 기능과 초보자와 전문가 모두에게 설계된 직관적인 사용자 인터페이스가 포함됩니다.
ru: Основные функции включают в себя расширенные возможности обработки и интуитивно понятный пользовательский интерфейс, разработанный для начинающих и опытных пользователей.
vi: Các tính năng chính bao gồm khả năng xử lý nâng cao và một giao diện người dùng dễ sử dụng được thiết kế cho cả người mới bắt đầu và người có kinh nghiệm.

source: Language:
fr: Langue:
ja: 言語:
ko: 언어:
ru: Язык:
vi: Ngôn ngữ:

source: Last login on {0}.
fr: Dernière connexion le {0}.
ja: 最終ログイン：{0}
ko: 마지막 로그인: {0}
ru: Последний вход {0}.
vi: Đăng nhập gần nhất vào {0}.

source: Love between two friends of the opposite sex often blossoms from empathy and deep understanding. It is not born of fleeting emotions, but built upon a foundation of trust and respect. Through the years they spend side by side, friendship slowly transforms into a profound connection, rising above ordinary affection. At times, this bond may unfold into romantic love, when both realize they are inseparable. Such love endures, for it has been tested and tenderly nurtured by time.
fr: L’amour entre deux amis de sexe opposé naît souvent de l’empathie et de la compréhension. Il ne naît pas d’émotions passagères, mais se construit sur une base de confiance et de respect. Au fil des années passées côte à côte, l’amitié se transforme peu à peu en un lien profond, s’élevant au-delà de l’affection ordinaire. Parfois, ce lien s’épanouit en amour romantique, lorsque tous deux réalisent qu’ils ne peuvent vivre l’un sans l’autre. Un tel amour dure, car il a été mis à l’épreuve et tendrement nourri par le temps.
ja: 異性の二人の友情は、しばしば共感と理解から始まります。それは一時的な感情から生まれるのではなく、信頼と尊重という土台の上に築かれるのです。長い年月を共に過ごす中で、その友情は次第に深い絆へと変わり、ありふれた感情を超えていきます。やがて、互いがなくては生きられないと気づいたとき、その絆は恋愛へと発展することもあります。そのような愛は、時の試練を受け、育まれてきたからこそ、永遠に続くものとなるのです。
ko: 이성 친구 사이의 사랑은 종종 공감과 이해에서 시작됩니다. 그것은 순간적인 감정에서 비롯되는 것이 아니라, 신뢰와 존중이라는 토대 위에 세워집니다. 오랜 세월을 함께 보내면서 우정은 점차 깊은 인연으로 변하며, 평범한 감정을 넘어섭니다. 때로는 서로 없이는 살 수 없음을 깨달을 때, 그 우정은 로맨틱한 사랑으로 발전하기도 합니다. 이러한 사랑은 시간의 시험을 견뎌내고 오랫동안 길러져 왔기에 더욱 오래 지속됩니다.
ru: Любовь между двумя друзьями противоположного пола часто проявляется из-за сопереживания и глубокого понимания. Она не рождается из поверхностных эмоций, а строится на основе доверия и уважения. С течением времени дружба постепенно превращается в глубокую связь, выходящую за рамки обычного привязанности. В некоторых случаях эта связь может развиться в романтическую любовь, когда оба понимают, что они неразлучны. Такая любовь продолжается, потому что она была проверена временем и тщательно выращивалась им.
vi: Tình yêu giữa hai người bạn khác giới thường bắt đầu từ sự đồng cảm và thấu hiểu. Nó được xây dựng trên nền tảng của sự tin tưởng, tôn trọng, không phải từ những rung động nhất thời. Trải qua những năm tháng cùng nhau, tình bạn dần trở thành một mối quan hệ sâu sắc, vượt lên trên tình cảm thông thường. Đôi khi, tình bạn này có thể phát triển thành tình yêu lãng mạn, khi cả hai nhận ra rằng họ không thể sống thiếu nhau. Tình yêu như vậy thường bền vững, vì nó đã được thử thách và nuôi dưỡng qua thời gian.

source: Marked as read.
fr: Marqué comme lu.
ja: 既読にしました。
ko: 읽음으로 표시되었습니다.
ru: Отмечено как прочитанное.
vi: Đã đánh dấu là đã đọc.

source: Message Inbox
fr: Boîte de réception
ja: メッセージ受信箱
ko: 메시지 받은편지함
ru: Ящик сообщений
vi: Hộp thư đến

source: Open
fr: Ouvrir
ja: 開く
ko: 열기
ru: Открыть
vi: Mở

source: Our flagship product combines cutting-edge technology with sleek design. Built with premium materials, it offers unparalleled performance and reliability.
fr: Notre produit phare combine la technologie de pointe avec un design élégant. Construit avec des matériaux de haute qualité, il offre des performances inégalées et une fiabilité sans équivalent.
ja: 私たちの旗艦製品は、最先端の技術とエレガントなデザインを組み合わせています。最高品質の材料で作られており、優れたパフォーマンスと信頼性を提供します。
ko: 우리의 대표 제품은 최신 기술과 우아한 디자인을 결합합니다. 최고급 재료로 제작되어 뛰어난 성능과 신뢰성을 제공합니다.
ru: Наша флагманская продукция сочетает в себе передовые технологии и элегантный дизайн. Изготовленная из премиальных материалов, она предлагает несомненные преимущества и надежность.
vi: Sản phẩm chính của chúng tôi kết hợp công nghệ tiên tiến với thiết kế mới mẻ. Được xây dựng từ vật liệu chất lượng cao, nó mang đến hiệu suất và độ tin cậy vượt trội.

source: Our hassle-free return process includes free return shipping and full refunds processed within 48 hours of receiving the returned item.
fr: Notre processus de retour sans souci inclut le transport gratuit et les remboursements complets traités dans les 48 heures après la réception de l’article retourné.
ja: 私たちの簡単な返品プロセスには、無料の返送配送と返品商品の受領後48時間以内に処理される完全な返金が含まれています。
ko: 우리의 간편한 반품 프로세스에는 무료 반품 배송과 반품 아이템을 수신한 후 48시간 이내에 처리되는 전액 환불이 포함됩니다.
ru: Наш беспроблемный процесс возврата включает бесплатную доставку и полные возвраты в течение 48 часов после получения возвращенного товара.
vi: Quy trình hoàn trả không có vấn đề của chúng tôi bao gồm phí vận chuyển hoàn trả miễn phí và hoàn trả đầy đủ được xử lý trong vòng 48 giờ sau khi nhận được sản phẩm đã hoàn trả.

source: Product Information
fr: Informations sur le produit
ja: 製品情報
ko: 제품 정보
ru: Информация о продукте
vi: Thông tin sản phẩm

source: Return Policy
fr: Politique de retour
ja: 返品ポリシー
ko: 반품 정책
ru: Политика возврата
vi: Chính sách hoàn trả

source: See all <0>unread messages</0> or <1>mark them</1> as read.
fr: Voir tous les <0>messages non lus</0> ou <1>les marquer</1> comme lus.
ja: すべての<0>未読メッセージ</0>を表示するか、<1>既読にマーク</1>してください。
ko: 모든 <0>읽지 않은 메시지</0>를 보거나 <1>읽음으로 표시</1>하세요.
ru: Посмотреть все <0>непрочитанные сообщения</0> или <1>отметить их</1> как прочитанные.
vi: Xem tất cả <0>tin nhắn chưa đọc</0> hoặc <1>đánh dấu chúng</1> là đã đọc.

source: Shipping Details
fr: Détails de livraison
ja: 配送詳細
ko: 배송 상세
ru: Детали доставки
vi: Chi tiết vận chuyển

source: We offer worldwide shipping through trusted courier partners. Standard delivery takes 3-5 business days, while express shipping ensures delivery within 1-2 business days.
fr: Nous offrons une livraison mondiale via des partenaires de messagerie fiables. La livraison standard prend 3-5 jours ouvrables, tandis que la livraison express garantit la livraison dans les 1-2 jours ouvrables.
ja: 信頼できる配達業者を通じて、世界中への配送を提供しています。標準配送は3-5営業日、速達配送は1-2営業日以内に配達を保証します。
ko: 신뢰할 수 있는 택배 파트너를 통해 전 세계 배송을 제공합니다. 표준 배송은 3-5일, 표준 배송은 1-2일 이내에 배송을 보장합니다.
ru: Мы предлагаем доставку по всему миру через надежных партнеров-курьеров. Стандартная доставка занимает 3-5 рабочих дней, а экспресс-доставка гарантирует доставку в течение 1-2 рабочих дней.
vi: Chúng tôi cung cấp vận chuyển toàn cầu thông qua đối tác vận chuyển đáng tin cậy. Giao hàng tiêu chuẩn mất 3-5 ngày làm việc, trong khi giao hàng nhanh chóng đảm bảo giao hàng trong vòng 1-2 ngày làm việc.

source: We stand behind our products with a comprehensive 30-day return policy. If you're not completely satisfied, simply return the item in its original condition.
fr: Nous nous engageons sur nos produits avec une politique de retour de 30 jours. Si vous n'êtes pas complètement satisfait, retournez simplement l'article dans son état d'origine.
ja: 私たちは、30日間の返品ポリシーを採用しています。完全に満足しない場合は、元の状態で返品してください。
ko: 우리는 30일 반품 정책을 통해 제품을 지지합니다. 완전히 만족하지 못한다면, 단순히 원래 상태로 반품하세요.
ru: Мы поддерживаем наши продукты с комплексной политикой возврата на 30 дней. Если вы не полностью удовлетворены, просто верните товар в его первоначальном состоянии.
vi: Chúng tôi đứng sau sản phẩm của mình với chính sách hoàn trả 30 ngày. Nếu bạn không hoàn toàn hài lòng, chỉ cần trả lại sản phẩm trong điều kiện ban đầu của nó.
